### Creating Dataset

In [2]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]

GradeList = zip(names,grades)
df = pd.DataFrame(data = GradeList,
                  columns=['Names', 'Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

### Filtering Out Impossible Grades

In [34]:
df1 = df.loc[df['Grades'] <= 100]
df1

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78

### Change Impossible Grades

In [3]:
df.loc[
    (df['Grades'] >= 100,'Grades')] = 100
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     100

### Your  Turn

<p> Using the dataset from this section, can you replace all the subzero grades with a grade of zero?</p>

In [4]:
df.loc[
    (df['Grades'] <= 0,'Grades')] = 0
df

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     100